from rest_framework.pagination import PageNumberPagination


class PropertyPagination(PageNumberPagination):
    page_size = 4

"""
PropertyPagination - это пользовательский класс пагинации в Django REST Framework. 
Пагинация используется для разделения большого набора данных на более мелкие порции 
(страницы), которые отправляются клиенту по мере необходимости. 
Это помогает управлять объемом данных, уменьшая время ожидания ответа и снижая нагрузку 
на сервер.

Класс PageNumberPagination - это встроенный класс пагинации в DRF, 
который основан на номерах страниц. Когда клиент делает запрос, 
он может указать номер страницы, и сервер вернет соответствующую порцию данных.

PropertyPagination - это пользовательский класс пагинации, который наследуется от PageNumberPagination.

page_size = 4 - это атрибут класса, который устанавливает количество элементов 
данных на одной странице. В данном случае, каждая страница 
будет содержать не более 4 объектов.
"""